import React from "react";
import Navbar from "./Navbar.js";
import Footer from "./footer.js";

const Usepolicy = () => {
  return (
    <div className="App">
      <div className="main">
        <Navbar />
      </div>
      <div className="usepolicy">
        <h1 align="center">WB遊戲工作室服務條款</h1>
        <div align="center"></div>
        <br />
        <p>
          我們（以下稱工作室）將根據本條款向玩家和會員提供方便快捷的網站體驗服務，及提供最新的活動資訊。在使用本服務前，敬請細閱本條款，包括個人資料(私隱)的政策聲明及網站體驗須知。如您不同意本條款之任何內容，請勿使用本網站。當您使用本網站時(含瀏覽本網站)，您會被視為經已閱讀、瞭解並同意接受本條款的所有內容。
        </p>

        <p>
          <strong>一、 使用本網站</strong>
          <br />
          1.
          本網站僅可以合法方式用於合法用途。您同意遵守有關本網站的所有適用法律法規。
        </p>

        <ol type="1">
          <li>
            您切勿侵害或試圖侵害本網站的安全，包括但不限於存取並非供您使用的資料、登入並無授權您存取的伺服器、探索、掃描或測試本網站所運用的系統或網絡的漏洞、違反本網站所採納的安全或認證措施，以及干擾其他使用者瀏覽或使用本網站。
          </li>
          <li>
            您不得濫用本網站，蓄意引入病毒、木馬程式、蠕蟲病毒及邏輯炸彈，或任何其他惡意或技術上有害的素材，且不得以任何方式（包括但不限於透過阻斷服務攻擊或分散式阻斷服務攻擊）攻擊本網站。
          </li>
          <li>
            倘您違反或侵犯，或工作室懷疑您已違反或侵犯或試圖違反或侵犯本條款的任何條文或任何適用法律法規，工作室有絕對權力驅逐您及阻止您再次瀏覽本網站（包括但不限於封截您的網際協定位址（IP
            Address）），而不會向您作出任何通知及賠償。
          </li>
          <li>
            您違反或試圖違反本條款一，將令您須承擔民事責任及有可能須承擔刑事責任，而工作室會於認為必須及合宜的情況下，向您採取法律行動，包括但不限於向相關執法機關舉報及向彼等披露您的身份。
          </li>
        </ol>

        <p>
          <strong>二、</strong>
          <strong>玩家和會員</strong>
          <strong>個人資料及帳戶管理</strong>
          <br />
          1.
          在您使用網上玩家和會員服務之前，請先註冊成為工作室的網上玩家和會員，無須支付任何費用；在完成註冊後，可使用會員服務及參加工作室提供相關之活動。如所提供的資料有變動，請即時更新，以保障您的權益。
        </p>

        <ol type="1">
          <li>
            您必須提供正確的個人資料及通訊資料，若工作室懷疑您所提供之資料有錯誤或虛偽不實或故意冒用他人姓名等，工作室可拒絕註冊您成為玩家和會員，亦有權立即暫停或終止您的玩家和會員資格，不會向您作出任何賠償。
          </li>
          <li>
            請您妥善保管您的電郵地址、帳戶密碼、信用卡資料及個人資料，不應將任何該等資料提供給任何人使用，以保障您的資料安全。如您發現您的資料遭他人非法使用，應立即通知工作室。如您的資料遭黑客取得或因個人的保管疏忽導致您的資料遭他人非法使用，工作室概不承擔任何責任。
          </li>
        </ol>

        <p>
          <strong>三、 網站內容變更</strong>
          <br />
          您同意工作室可隨時調整、變更、修改或撤銷本條款及相關的服務的全部或部分，並於工作室公告後立即生效，不作另行個別通知。在任何情況下，工作室不會就本條款及或相關服務的修改或撤銷向您承擔任何責任，未完的供貨責任除外。
        </p>

        <p>
          <strong>四、</strong>
          <strong>網站體驗</strong>
          <strong>須知</strong>
          <br />
          就有關網站體驗的程序及相關條款，請參閱本網站的「網站體驗須知」，「網站體驗須知」為本條款的組成部分。
        </p>

        <p>
          <strong>五、知識產權</strong>
          <br />
          工作室擁有本網站所載內容之版權或獲授權使用本網站所載內容（包括但不限於部分或全部書面文字、視像、音效、相片或其他影像）。除非您獲工作室書面准許，否則不得使用、複印、再造、發送、張貼、刊登、再使用、再刊登、再張貼、更改、儲存於恢復系統、用於創作衍生作品、上載、告示、以郵電方式發送、透過任何形式或渠道傳遞或以任何方式發放載於本網站的任何內容作公眾或商業用途、或自行製作任何超連結連接到本網站。您可以下載本網站資料供私人使用，惟您必須保留資料內所有版權及其他擁有權通知。
        </p>

        <p>
          <strong>六、連結至其他網站</strong>
          <br />
          倘本網站提供往其他由工作室的聯屬公司或任何其他第三方營運的網站的連結，該等連結僅為方便您使用，不應視作工作室以任何形式支持批准該等網站的內容。倘您瀏覽該等網站，須自行承擔您的風險，並受有關網站內的適用條款及條件所限。工作室不會就該等網站是否存在，以及當中所載的內容承擔任何責任，且不會就此發表任何聲明、保證或承諾（不論為明示或暗示）。工作室不會就因您使用該等網站而產生的任何損失、損害及其他責任而負責。任何有關該等網站的問題或意見應向該等網站的營運商及／或擁有人反映。
        </p>

        <p>
          <strong>七、免責聲明及責任限制</strong>
          <br />1
          鑒於科技及在線環境屬不可預測，工作室並不保證（不論明示或暗示）本網站的功能、運作或連接能力會不受干預及無誤，亦不保證當中的缺陷會得到修正，或本網站或可供本網站使用的伺服器將無病毒、木馬程式、蠕蟲程式或其他有害成份。您有責任確保您備有合適的設備以正常瀏覽及使用本網站，並排除任何可能損害您電腦的事項。工作室不會就由您使用或未能瀏覽本網站及／或與之有關的任何事項承擔責任。
        </p>

        <p>
          2
          本網站及其內容按「現狀」提供，風險須由您自行承擔，且無任何形式的保證。在適用法律法規所允許的最大程度下，工作室不會就本網站及當中所載活動資訊概不作出任何形式的保證（不論明示或暗示）。
        </p>
      </div>
      <Footer/>
    </div>
  );
};

export default Usepolicy;
